{
    "books": {
        "6e143aa0-eaed-4ed0-a176-f60c9f11b1f0": {
            "title": "Tom Sawyer",
            "author": "Mark Twain",
            "image": "https://m.media-amazon.com/images/I/71l6aEDzaFS._AC_UF1000,1000_QL80_.jpg",
            "information": "The Adventures of Tom Sawyer is an 1876 novel by Mark Twain about a boy growing up along the Mississippi River. It is set in the 1840s in the town of St. Petersburg, which is based on Hannibal, Missouri, where Twain lived as a boy. In the novel, Tom Sawyer has several adventures, often with his friend Huckleberry Finn. Originally a commercial failure, the book ended up being the best selling of Twain's works during his lifetime. Though overshadowed by its sequel, Adventures of Huckleberry Finn, the book is considered by many to be a masterpiece of American literature. It was one of the first novels to be written on a typewriter.",
            "summary": " An imaginative and mischievous boy named Tom Sawyer lives with his Aunt Polly and his half-brother, Sid, in the Mississippi River town of St. Petersburg, Missouri. After playing hooky from school on Friday and dirtying his clothes in a fight, Tom is made to whitewash the fence as punishment on Saturday. At first, Tom is disappointed by having to forfeit his day off. However, he soon cleverly persuades his friends to trade him small treasures for the privilege of doing his work. He trades these treasures for tickets given out in Sunday school for memorizing Bible verses and uses the tickets to claim a Bible as a prize. He loses much of his glory, however, when, in response to a question to show off his knowledge, he incorrectly answers that the first two disciples were David and Goliath.",
            "price": "20",
            "_id": "6e143aa0-eaed-4ed0-a176-f60c9f11b1f0",
            "userId": "96f0adcb-dc3d-4b55-83dd-637ef6473b45"
        },
        "bc7375d4-3034-43cc-a9d8-c79bc9101e74": {
            "title": "Jane Eyre",
            "author": "Charlotte Brontë",
            "image": "https://m.media-amazon.com/images/I/61c1BiBgvdL._AC_UF1000,1000_QL80_.jpg",
            "information": "Jane Eyre is a novel by the English writer Charlotte Brontë. It was published under her pen name Currer Bell on 19 October 1847 by Smith, Elder & Co. of London. The first American edition was published the following year by Harper & Brothers of New York. Jane Eyre is a Bildungsroman which follows the experiences of its eponymous heroine, including her growth to adulthood and her love for Mr Rochester, the brooding master of Thornfield Hall. The novel revolutionised prose fiction by being the first to focus on its protagonist's moral and spiritual development through an intimate first-person narrative, where actions and events are coloured by a psychological intensity. Charlotte Brontë has been called the first historian of the private consciousness, and the literary ancestor of writers like Marcel Proust and James Joyce. The book contains elements of social criticism with a strong sense of Christian morality at its core, and it is considered by many to be ahead of its time because of Jane's individualistic character and how the novel approaches the topics of class, sexuality, religion, and feminism. It, along with JaneAusten's Pride and Prejudice, is one of the most famous romance novels.",
            "summary": "When the novel begins, the title character is a 10-year-old orphan who lives with her uncle’s family; her parents had died of typhus. Other than the nursemaid, the family ostracizes Jane. She is later sent to the austere Lowood Institution, a charity school, where she and the other girls are mistreated; “Lowood,” as the name suggests, is the “low” point in Jane’s young life. In the face of such adversity, however, she gathers strength and confidence. Books. Reading. Publishing. Print. Literature. Literacy. Rows of used books for sale on a table. In early adulthood, after several years as a student and then teacher at Lowood, Jane musters the courage to leave. She finds work as a governess at Thornfield Hall, where she meets her dashing and Byronic employer, the wealthy and impetuous Edward Rochester. At Thornfield Jane looks after young Adèle, the daughter of a French dancer who was one of Rochester’s mistresses, and is befriended by the kindly housekeeper Mrs. Alice Fairfax. Jane falls in love with Rochester, though he is expected to marry the snobbish and socially prominent Blanche Ingram. Rochester eventually reciprocates Jane’s feelings and proposes marriage. However, on their wedding day, Jane discovers that Rochester cannot legally marry her, because he already has a wife, Bertha Mason, who has gone mad and is locked away on the third floor because of her violent behaviour; her presence explains the strange noises Jane has heard in the mansion. Believing that he was tricked into that marriage, Rochester feels justified in pursuing his relationship with Jane. He pleads with her to join him in France, where they can live as husband and wife despite the legal prohibitions, but Jane refuses on principle and flees Thornfield. Jane is taken in by people she later discovers are her cousins. One of them is St. John, a principled clergyman. He gives her a job and soon proposes marriage, suggesting that she join him as a missionary in India. Jane initially agrees to leave with him but not as his wife. However, St. John pressures her to reconsider his proposal, and a wavering Jane finally appeals to Heaven to show her what to do. Just then, she hears a mesmeric call from Rochester. Jane returns to Thornfield to find the estate burned, set on fire by Rochester’s wife, who then jumped to her death. Rochester, in an attempt to save her, was blinded. Reunited, Jane and Rochester marry. Rochester later regains some of his sight, and the couple have a son.",
            "price": "9",
            "_id": "bc7375d4-3034-43cc-a9d8-c79bc9101e74",
            "userId": "06a23595-4c2b-4f29-937d-427103617c12"
        },
        "257961fc-85a3-47aa-97e7-af3da638dd6e": {
            "title": "Fire and Blood",
            "author": "George R.R. Martin",
            "image": "https://cdn.ozone.bg/media/catalog/product/cache/1/image/9df78eab33525d08d6e5fb8d27136e95/f/i/2ba1f71e415bcba3db0748efb7440a30/fire-and-blood-30.jpg",
            "information": "The thrilling history of the Targaryens comes to life in this masterly work by the author of A Song of Ice and Fire, the inspiration for HBO’s Game of Thrones. With all the fire and fury fans have come to expect from internationally bestselling author George R. R. Martin, this is the first volume of the definitive two-part history of the Targaryens in Westeros. Centuries before the events of A Game of Thrones, House Targaryen—the only family of dragonlords to survive the Doom of Valyria—took up residence on Dragonstone. Fire and Blood begins their tale with the legendary Aegon the Conqueror, creator of the Iron Throne, and goes on to recount the generations of Targaryens who fought to hold that iconic seat, all the way up to the civil war that nearly tore their dynasty apart. What really happened during the Dance of the Dragons? Why did it become so deadly to visit Valyria after the Doom? What is the origin of Daenerys’s three dragon eggs? These are but a few of the questions answered in this essential chronicle, as related by a learned maester of the Citadel and featuring more than eighty all-new black-and-white illustrations by artist Doug Wheatley. Readers have glimpsed small parts of this narrative in such volumes as The World of Ice & Fire, but now, for the first time, the full tapestry of Targaryen history is revealed. With all the scope and grandeur of Gibbon’s The History of the Decline and Fall of the Roman Empire, Fire and Blood is the ultimate game of thrones, giving readers a whole new appreciation for the dynamic, often bloody, and always fascinating history of Westeros.",
            "summary": "Fire & Blood begins their tale with the legendary Aegon the Conqueror, creator of the Iron Throne, and goes on to recount the generations of Targaryens who fought to hold that iconic seat, all the way up to the civil war that nearly tore their dynasty apart.",
            "price": "22",
            "_id": "257961fc-85a3-47aa-97e7-af3da638dd6e",
            "userId": "96f0adcb-dc3d-4b55-83dd-637ef6473b45"
        },
        "676d9823-019c-47b8-8e3f-99418f67e8a8": {
            "title": "The Adventures of Sherlock Holmes",
            "author": "Arthur Conan Doyle",
            "image": "https://cdn.ozone.bg/media/catalog/product/cache/1/image/9df78eab33525d08d6e5fb8d27136e95/t/h/717fb7f7ec59b09b79f1659e7d856a87/the-adventures-of-sherlock-holmes-alma-classics-30.jpg",
            "information": "The Adventures of Sherlock Holmes is a collection of twelve short stories by British writer Arthur Conan Doyle, first published on 14 October 1892. It contains the earliest short stories featuring the consulting detective Sherlock Holmes, which had been published in twelve monthly issues of The Strand Magazine from July 1891 to June 1892. The stories are collected in the same sequence, which is not supported by any fictional chronology. The only characters common to all twelve are Holmes and Dr. Watson and all are related in first-person narrative from Watson's point of view. In general the stories in The Adventures of Sherlock Holmes identify, and try to correct, social injustices. Holmes is portrayed as offering a new, fairer sense of justice. The stories were well received, and boosted the subscriptions figures of The Strand Magazine, prompting Doyle to be able to demand more money for his next set of stories. The first story, A Scandal in Bohemia, includes the character of Irene Adler, who, despite being featured only within this one story by Doyle, is a prominent character in modern Sherlock Holmes adaptations, generally as a love interest for Holmes. Doyle included four of the twelve stories from this collection in his twelve favourite Sherlock Holmes stories, picking The Adventure of the Speckled Band as his overall favourite.",
            "summary": "All of the stories within The Adventures of Sherlock Holmes are told in a first-person narrative from the point of view of Dr. Watson, as is the case for all but four of the Sherlock Holmes stories. The Oxford Dictionary of National Biography entry for Doyle suggests that the short stories contained The Adventures of Sherlock Holmes tend to point out social injustices, such as a king's betrayal of an opera singer, a stepfather's deception of his ward as a fictitious lover, an aristocratic crook's exploitation of a failing pawnbroker, a beggar's extensive estate in Kent. It suggests that, in contrast, Holmes is portrayed as offering a fresh and fair approach in an unjust world of official incompetence and aristocratic privilege. The Adventures of Sherlock Holmes contains many of Doyle's favourite Sherlock Holmes stories. In 1927, he submitted a list of what he believed were his twelve best Sherlock Holmes stories to The Strand Magazine. Among those he listed were The Adventure of the Speckled Band (as his favourite), The Red-Headed League (second), A Scandal in Bohemia (fifth) and The Five Orange Pips (seventh). The book was banned in the Soviet Union in 1929 because of its alleged occultism, but the book gained popularity in a black market of similarly banned books, and the restriction was lifted in 1940.",
            "price": "9",
            "_id": "676d9823-019c-47b8-8e3f-99418f67e8a8",
            "userId": "96f0adcb-dc3d-4b55-83dd-637ef6473b45"
        },
        "f859f3e9-a3ca-4ac1-8937-b374792c9548": {
            "title": "The Witcher - The last wish",
            "author": "Andrzej Sapkowski",
            "image": "https://m.media-amazon.com/images/I/81MTXlALp+L._AC_UF1000,1000_QL80_.jpg",
            "information": "The Last Wish (Polish: Ostatnie życzenie) is the third published short story collection in Polish fantasy writer Andrzej Sapkowski's The Witcher series. Published by SuperNowa in 1993, it was preceded by 1992's Sword of Destiny, but is officially considered the first entry in the series and Sword of Destiny the second. The collection contains seven short stories interspersed with a continuing frame story: Geralt of Rivia, after having been injured in battle, rests in a temple. During that time he has flashbacks to recent events in his life, with each flashback forming a short story. The Last Wish was first published in English on 7 June 2007 by Gollancz, and has also been translated into several other languages. In 2003, it won the Premio Ignotus for Best Anthology.",
            "summary": "Geralt the Witcher—revered and hated—holds the line against the monsters plaguing humanity in this collection of adventures, the first chapter in Andrzej Sapkowski’s groundbreaking epic fantasy series that inspired the hit Netflix show and the blockbuster video games. Geralt is a Witcher, a man whose magic powers, enhanced by long training and a mysterious elixir, have made him a brilliant fighter and a merciless hunter. Yet he is no ordinary killer. His sole purpose: to destroy the monsters that plague the world. But not everything monstrous-looking is evil and not everything fair is good . . . and in every fairy tale there is a grain of truth.",
            "price": "14",
            "_id": "f859f3e9-a3ca-4ac1-8937-b374792c9548",
            "userId": "96f0adcb-dc3d-4b55-83dd-637ef6473b45"
        }
    },
    "comments": {
        "6e143aa0-eaed-4ed0-a176-f60c9f11b1f0": {
            "8d70a6d5-9327-4083-9b4f-d04d41bc7c04": {
                "username": "John10",
                "tag": "@John Johnston",
                "comment": "Great book!!!!",
                "_ownerId": "96f0adcb-dc3d-4b55-83dd-637ef6473b45",
                "_id": "8d70a6d5-9327-4083-9b4f-d04d41bc7c04"
            },
            "0c4b011a-4944-4e1c-b863-23ceb4ee5330": {
                "username": "Peter24",
                "tag": "@Peter McCarthy",
                "comment": "My favorite book. I strongly recommend it. Very easy to read and to understand",
                "_ownerId": "96f0adcb-dc3d-4b55-83dd-637ef6473b45",
                "_id": "0c4b011a-4944-4e1c-b863-23ceb4ee5330"
            }
        },

        "257961fc-85a3-47aa-97e7-af3da638dd6e": {
            "2b7d8db3-755e-47f2-86b6-92652f956e0b": {
                "username": "Mike",
                "tag": "@Mike",
                "comment": "The story of the book is great. When i started to read it i immediately fell in love with some of the characters",
                "_ownerId": "96f0adcb-dc3d-4b55-83dd-637ef6473b45",
                "_id": "2b7d8db3-755e-47f2-86b6-92652f956e0b"
            }
        }
    }
}